// ConsoleApplication10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
using namespace std;



string TileMapI[20] = {
	"0000000000000000000000000000000000000000",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0               00                     0",
	"0               00  00                 0",
	"0           00  00  00              hhh0",
	"0           00  00  00          e   h p0",
	"000000000   00  00  00   000000000000000",
	"000000000   00  00  00   000000000000000",
	"0llllllllllllllllllllllllllllllllllllll0",
	"0llllllllllllllllllllllllllllllllllllll0",
	"0llllllllllllllllllllllllllllllllllllll0",
	"0000000000000000000000000000000000000000",
};

//Уровень 2

string TileMapII[20] = {
	"0000000000000000000000000000000000000000",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0                                      0",
	"0              e                       0",
	"0        s     0  0                    0",
	"0        s     0           0           0",
	"0        s     0     0          0      0",
	"0   e    s     0                       0",
	"0   0    0     0                  s hhh0",
	"0   0       00   e         e      s h  0",
	"0   0       00  000        0      s h p0",
	"00000       00           0        000000",
	"00000       00 e e 000        0   000000",
	"0llllllllllll0000000lllllllllllllllllll0",
	"0llllllllllllllllllllllllllllllllllllll0",
	"0llllllllllllllllllllllllllllllllllllll0",
	"0000000000000000000000000000000000000000",
};


string* changeLevel( int& numberLevel) {
	string* strMap = new string[20];
	int num = 1;
	if (numberLevel == 1) { strMap=TileMapI; }
	if (numberLevel == 2) { strMap = TileMapII; }
	return strMap;
}

int main()
{
	
	int num = 1;
	string* strMap1=changeLevel(num);
	for (int i = 0; i < 20; i++) {
		for (int j = 0; j < 40; j++) {
			cout << strMap1[i][j];
		}
		cout << endl;
	}

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
